       IDENTIFICATION DIVISION.
       PROGRAM-ID. onsenfout.
       AUTHOR. Roger.
       PROCEDURE DIVISION.
           DISPLAY "ça marche".
           STOP RUN.